fhermosilloup/MCU26/Biblioteca/HAL/stm32f103_hal.c
#include "stm32f103_hal.h"
#include <stdlib.h>

#define SYSCLK_MAX_FREQ	(72000000UL)
#define ADCCLK_MAX_FREQ	(14000000UL)
#define APB1CLK_MAX_FREQ	(32000000UL)

/*
 **************************************************************
 * RESET AND CLOCK CONTROL PERIPHERAL
 **************************************************************
 */
uint32_t SystemClock = HSI_VALUE;
uint32_t AHBClock = HSI_VALUE;
uint32_t APB1Clock = HSI_VALUE;
uint32_t APB2Clock = HSI_VALUE;
uint32_t ADCClock = HSI_VALUE / 2;
uint32_t USBClock = HSI_VALUE / 1.5;









void nvic_enable_irq(IRQn_Type IRQn)
{
  if ((int32_t)(IRQn) >= 0)
  {
    NVIC->ISER[(((uint32_t)IRQn) >> 5UL)] = (uint32_t)(1UL << (((uint32_t)IRQn) & 0x1FUL));
  }
}

void nvic_enable(void)
{
  __asm volatile ("cpsie i" : : : "memory");
}


/**
  \brief   Disable IRQ Interrupts
  \details Disables IRQ interrupts by setting the I-bit in the CPSR.
           Can only be executed in Privileged modes.
 */
void nvic_disable(void)
{
  __asm volatile ("cpsid i" : : : "memory");
}


void rcc_clock_enable(rcc_periph_clk_t clk)
{
	uint8_t uclk = (uint8_t)clk;
	if(uclk < 32)
	{
		RCC->APB1ENR |= 1 << uclk;
	}
	else if(uclk < 64)
	{
		uclk-=32;
		RCC->APB2ENR |= 1 << uclk;
	}
	else
	{
		uclk-=64;
		RCC->AHBENR |= 1 << uclk;
	}
}


void rcc_set_clock(rcc_sysclk_src_t src, rcc_pll_mul_t pll_mul)
{
	uint32_t pllmul = (uint32_t)pll_mul << 18;	// PLL multiplier
	uint32_t pllsrc = 0;	// HSI as PLL input
	uint32_t sysclk_src = 0;	// HSI
	SystemClock = HSI_VALUE;

	/* Comprobar src */
	uint8_t hse_en = src!=RCC_SYSCLK_HSI && src!=RCC_SYSCLK_PLL_HSI_DIV_2;
	uint8_t pll_en = src!=RCC_SYSCLK_HSI && src!=RCC_SYSCLK_HSE;

	// Apagar PLL
	RCC->CR &= ~RCC_CR_PLLON;
	while (RCC->CR & RCC_CR_PLLRDY);

	// Default
	SystemClock = HSI_VALUE;

	// HSE
	if (hse_en)
	{
			RCC->CR |= RCC_CR_HSEON;
			while (!(RCC->CR & RCC_CR_HSERDY));

			SystemClock = HSE_VALUE;
			pllsrc = RCC_CFGR_PLLSRC;
			sysclk_src = 0x01; 	// HSE

			if (src == RCC_SYSCLK_PLL_HSE_DIV_2)
			{
					SystemClock >>= 1; // FIX
					pllsrc |= RCC_CFGR_PLLXTPRE;
			}
	}

	// PLL
	if (pll_en)
	{
			SystemClock *= (pll_mul + 2);
			if(SystemClock > SYSCLK_MAX_FREQ)
			{
				SystemClock /= (pll_mul + 2);
				pll_mul = (uint32_t)SYSCLK_MAX_FREQ/SystemClock - 2;
				SystemClock *= (pll_mul + 2);
				pllmul = (uint32_t)pll_mul << 18;
			}
			if (!hse_en)
				SystemClock >>= 1;
			sysclk_src = 0x02;	// PLL

			RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMULL);
			RCC->CFGR |= pllsrc | pllmul;

			RCC->CR |= RCC_CR_PLLON;
			while (!(RCC->CR & RCC_CR_PLLRDY));
	}

	/* Reset prescalers */
	RCC->CFGR &= ~RCC_CFGR_PPRE2; // APB2Clock = AHB/1
	RCC->CFGR &= ~RCC_CFGR_PPRE1; // APB1Clock = AHB/1
	RCC->CFGR &= ~RCC_CFGR_ADCPRE; // ADCClock = APB2Clock / X
	RCC->CFGR &= ~RCC_CFGR_USBPRE; // USBClock = PLLClock/1.5
	AHBClock = SystemClock;
	APB1Clock = SystemClock;
	APB2Clock = SystemClock;
	ADCClock = APB2Clock >> 1;
	USBClock = SystemClock * 1.5;

	// Check for APB1 limits (<= 32MHz)
	if(SystemClock > APB1CLK_MAX_FREQ)
	{
		RCC->CFGR |= RCC_CFGR_PPRE1_DIV2; // APB1 /2
		APB1Clock = SystemClock >> 1;
	}

	// ADC Clock check
	uint8_t adc_prescaler = 4;
	while(ADCClock > ADCCLK_MAX_FREQ && adc_prescaler <= 8)
	{
		if (APB2Clock / adc_prescaler <= ADCCLK_MAX_FREQ)
		{
			RCC->CFGR &= ~RCC_CFGR_ADCPRE;
			ADCClock = APB2Clock >> (adc_prescaler>>1);
			RCC->CFGR |= (uint32_t)((adc_prescaler>>1)-1) << 14;
			break;
		}
		adc_prescaler+=2;
	}

	// FLASH antes del cambio
	FLASH->ACR &= ~FLASH_ACR_LATENCY;
	if (SystemClock <= 24000000)
			FLASH->ACR |= FLASH_ACR_LATENCY_0;
	else if (SystemClock <= 48000000)
			FLASH->ACR |= FLASH_ACR_LATENCY_1;
	else
			FLASH->ACR |= FLASH_ACR_LATENCY_2;
	FLASH->ACR |= FLASH_ACR_PRFTBE;

	/* Seleccionar fuente SYSCLK */
	RCC->CFGR &= ~0x03;
	RCC->CFGR |= sysclk_src;
	while (((RCC->CFGR >> 2) & 0x3) != sysclk_src);
}

void rcc_set_bus_clk_div(rcc_bus_t bus, rcc_div_t clkdiv)
{
	uint32_t uclkdiv = (uint32_t)clkdiv;
	if(bus == RCC_BUS_AHB)
	{
		uclkdiv += 0x04;
		RCC->CFGR &= ~(0x0F << 4);
		RCC->CFGR |= uclkdiv << 4;
    AHBClock = (uclkdiv < 5 ? SystemClock >> uclkdiv : SystemClock >> (uclkdiv+1));
	}
	else
	{
		if(uclkdiv > (uint32_t)RCC_DIV_16) return;
		uclkdiv += 0x03;
		if(bus == RCC_BUS_APB1)
		{
			RCC->CFGR &= ~(0x07 << 8);
			RCC->CFGR |= uclkdiv << 8;
      APB1Clock = SystemClock >> uclkdiv;
		}
		else
		{
			RCC->CFGR &= ~(0x07 << 11);
			RCC->CFGR |= uclkdiv << 11;
      APB2Clock = SystemClock >> uclkdiv;
		}
	}
}

void rcc_set_adc_clk_div(rcc_adcclk_div_t clkdiv)
{
	RCC->CFGR &= ~(0x03 << 14);
	RCC->CFGR |= (uint32_t)clkdiv << 14;
  ADCClock = (clkdiv != RCC_ADC_DIV_6 ? APB2Clock >> ((uint32_t)clkdiv + 1) : APB2Clock / 6);
}

void rcc_set_usb_clk_div(rcc_usbclk_div_t clkdiv)
{
	RCC->CFGR &= ~(1 << 18);
	RCC->CFGR |= (uint32_t)clkdiv << 18;
  USBClock = ( clkdiv==RCC_USB_DIV_1 ? SystemClock : SystemClock * 1.5);

}

uint32_t rcc_get_bus_clock(rcc_bus_t bus)
{
	switch(bus)
	{
		case RCC_BUS_AHB: return AHBClock; break;
		case RCC_BUS_APB1: return APB1Clock; break;
		case RCC_BUS_APB2: return APB2Clock; break;
	}

	return 0;
}

uint32_t rcc_get_sysclk(void)
{
	return SystemClock;
}

uint32_t rcc_get_adc_clock(void)
{
	return ADCClock;
}

uint32_t rcc_get_usb_clock(void)
{
	return USBClock;
}


/*
 **************************************************************
 * GENERAL PURPOSE INPUT/OUTPUT PERIPHERAL
 **************************************************************
 */
void gpio_set_mode(GPIO_TypeDef *GPIOx, uint32_t pin_num, uint8_t mode)
{
	if(mode > 0x03) return;
	if(pin_num >= GPIO_PIN_MAX) return;

	if(pin_num < 8)
	{
		GPIOx->CRL &= ~(0x03 << (pin_num<<2));
		GPIOx->CRL |= ((uint32_t)mode << (pin_num<<2));
	}
	else
	{
		pin_num -= 8;
		GPIOx->CRH &= ~(0x03 << (pin_num<<2));
		GPIOx->CRH |= ((uint32_t)mode << (pin_num<<2));
	}

