fhermosilloup/MCU26/Biblioteca/HAL/stm32f103_hal.c
}

void gpio_set_cnf(GPIO_TypeDef *GPIOx, uint32_t pin_num, uint8_t cfn)
{
	if(cfn & ~(0x0C)) return;
	if(pin_num >= GPIO_PIN_MAX) return;

	if(pin_num < 8)
	{
		GPIOx->CRL &= ~(0x0C << (pin_num<<2));
		GPIOx->CRL |= ((uint32_t)cfn << (pin_num<<2));
	}
	else
	{
		pin_num -= 8;
		GPIOx->CRH &= ~(0x0C << (pin_num<<2));
		GPIOx->CRH |= ((uint32_t)cfn << (pin_num<<2));
	}
}

void gpio_set_input(GPIO_TypeDef *GPIOx, uint32_t pin_num, gpio_input_t mode)
{
	gpio_set_mode(GPIOx, pin_num, GPIO_MODE_INPUT);
	gpio_set_cnf(GPIOx, pin_num, (uint8_t)mode & 0x0F);

	// Check for pull-up
	if((uint8_t)mode & 0x10) GPIOx->ODR |= (1 << pin_num);
	else GPIOx->ODR &= ~(1 << pin_num);
}

void gpio_set_output(GPIO_TypeDef *GPIOx, uint32_t pin_num, gpio_output_t mode, gpio_speed_t speed)
{
	gpio_set_mode(GPIOx, pin_num, (uint8_t)speed);
	gpio_set_cnf(GPIOx, pin_num, (uint8_t)mode & 0x0F);

	GPIOx->ODR &= ~(1 << pin_num);
}

void gpio_disable_debug_pins(void)
{
	RCC->APB2ENR |= 1 << 0; 	//Enable AFIO clock
	AFIO->MAPR   |= 2UL << 24;	// Disable JTAG (PA15, PB3,PB4 as GPIO)
}



void gpio_bitwise_set(GPIO_TypeDef *GPIOx, uint16_t mask)
{
	GPIOx->BSRR = mask;
}
void gpio_bitwise_clear(GPIO_TypeDef *GPIOx, uint16_t mask)
{
	GPIOx->BRR = mask;
}
void gpio_bitwise_toggle(GPIO_TypeDef *GPIOx, uint16_t mask)
{
	GPIOx->ODR ^= mask;
}

uint8_t gpio_read_pin(GPIO_TypeDef *GPIOx, uint8_t pin_num)
{
	return GPIOx->IDR & (1UL << pin_num) ? 1 : 0;
}


/*
 **************************************************************
 * EXTERNAL INTERRUPT CONTROLLER
 **************************************************************
 */
void exti_set_interrupt(pin_t pin, exti_irq_t irq)
{
	// Get port
	uint8_t port = (uint8_t)pin >> 4;
	uint8_t pin_num = (uint8_t)pin & 0xF;

	// Enable EXTI clock (AFIO)
	RCC->APB2ENR |= 1 << 0;

	// Set exti pin
	uint8_t cr_idx = pin_num >> 2;
	AFIO->EXTICR[cr_idx] &= ~(0xFUL << ((pin_num & 0x03)<<2));
	AFIO->EXTICR[cr_idx] |= ((uint32_t)port << ((pin_num & 0x03)<<2));

	// Set rising and falling as specified
	EXTI->FTSR &= ~(1 << pin_num);
	EXTI->RTSR &= ~(1 << pin_num);
	switch(irq)
	{
		case EXTI_IRQ_FALLING:
			EXTI->FTSR |=  (1 << pin_num);
			EXTI->RTSR &= ~(1 << pin_num);
		break;

		case EXTI_IRQ_RISING:
			EXTI->RTSR |=  (1 << pin_num);
			EXTI->FTSR &= ~(1 << pin_num);
		break;

		case EXTI_IRQ_BOTH:
			EXTI->FTSR |=  (1 << pin_num);
			EXTI->RTSR |=  (1 << pin_num);
		break;
	}

	// Setup EXTIn line as an interrupt source.
	EXTI->IMR  |=  (1 << pin_num);  // Enable Interrupt source
}







/*
 **************************************************************
 * DIRECT MEMORY ACCESS (DMA)
 **************************************************************
 */
void dma_init(DMA_Channel_TypeDef *ch,
              dma_dir_t dir,
              dma_size_t mem_size,
              dma_size_t periph_size,
              bool mem_inc,
              bool periph_inc,
              dma_mode_t mode,
              dma_priority_t priority)
{
	rcc_clock_enable(RCC_DMA1);

    ch->CCR &= ~DMA_CCR_EN; // Deshabilitar canal antes de configurar

    ch->CCR = 0;
    ch->CCR |= (dir == DMA_DIR_MEM_TO_PERIPH) ? DMA_CCR_DIR : 0;
    ch->CCR |= (mem_inc ? DMA_CCR_MINC : 0);
    ch->CCR |= (periph_inc ? DMA_CCR_PINC : 0);
    ch->CCR |= (mode == DMA_MODE_CIRCULAR) ? DMA_CCR_CIRC : 0;

    switch (mem_size) {
        case DMA_SIZE_8BIT:  ch->CCR |= 0; break;
        case DMA_SIZE_16BIT: ch->CCR |= DMA_CCR_MSIZE_0; break;
        case DMA_SIZE_32BIT: ch->CCR |= DMA_CCR_MSIZE_1; break;
    }
    switch (periph_size) {
        case DMA_SIZE_8BIT:  ch->CCR |= 0; break;
        case DMA_SIZE_16BIT: ch->CCR |= DMA_CCR_PSIZE_0; break;
        case DMA_SIZE_32BIT: ch->CCR |= DMA_CCR_PSIZE_1; break;
    }

    switch (priority) {
        case DMA_PRIORITY_LOW:    ch->CCR |= 0; break;
        case DMA_PRIORITY_MEDIUM: ch->CCR |= DMA_CCR_PL_0; break;
        case DMA_PRIORITY_HIGH:   ch->CCR |= DMA_CCR_PL_1; break;
        case DMA_PRIORITY_VERY_HIGH: ch->CCR |= (DMA_CCR_PL_0 | DMA_CCR_PL_1); break;
    }
}

void dma_set_addresses(DMA_Channel_TypeDef *ch, volatile void *periph_addr, void *mem_addr, uint16_t length)
{
    ch->CPAR = (uint32_t)periph_addr;
    ch->CMAR = (uint32_t)mem_addr;
    ch->CNDTR = length;
}

void dma_set_interrupt(DMA_Channel_TypeDef *ch, dma_irq_t irq, irq_state_t state)
{
    if (state) {
        switch (irq) {
            case DMA_IRQ_TC: ch->CCR |= DMA_CCR_TCIE; break;
            case DMA_IRQ_HT: ch->CCR |= DMA_CCR_HTIE; break;
            case DMA_IRQ_TE: ch->CCR |= DMA_CCR_TEIE; break;
        }
    } else {
        switch (irq) {
            case DMA_IRQ_TC: ch->CCR &= ~DMA_CCR_TCIE; break;
            case DMA_IRQ_HT: ch->CCR &= ~DMA_CCR_HTIE; break;
            case DMA_IRQ_TE: ch->CCR &= ~DMA_CCR_TEIE; break;
        }
    }
}

void dma_start(DMA_Channel_TypeDef *ch)
{
    ch->CCR |= DMA_CCR_EN;
}

void dma_stop(DMA_Channel_TypeDef *ch)
{
    ch->CCR &= ~DMA_CCR_EN;
}




/*
 **************************************************************
 * SYSTEM CLOCK TIMER
 **************************************************************
 */
void systick_config(uint32_t period, systick_clksrc_t clksrc)
{
	/*
	 * SysTick is a 24-bit counter with clock derived from the AHBClock
	 *
	 * Steps:
	 * 1. Programming reload value using LOAD register
	 * 2. Clear current value using the VAL variable
	 * 3. Select clock source via CLKSOURCE bit (2) on CTRL register.
	 *		0 - AHB/8
	 * 		1 - Processor Clock (AHB)
	 * 4. Enable Tick interrupt by setting TICKINT bit (1) of CTRL register.
	 * 5. Start SysTick timer using the ENABLE bit (0) of CTRL register
	 */
	SysTick->CTRL = 0;			// Reset Systick
	SysTick->LOAD = period;	// Set reload value
	SysTick->VAL = 0x00000000;	// Reset Systick counter
	SysTick->CTRL |= (uint32_t)clksrc << 2;	// Set clock source

