fhermosilloup/MCU26/Biblioteca/HAL/stm32f103_hal.c
	/* Set interrupt priority via SCB->SHP register.
	 * Although the SCB_SHPx are 32-bit registers (x = 1, 2, 3)
	 * the library define these registers as an array of 8-bit
	 * registers, since SHPR1-SHPR3 are byte accessible. To set the
	 * priority of the core peripherals, an 8-bit field is defined
	 * along each register, denoted to as PRI_n, where n = 4,...,15.
	 * The lower the value, the greater the priority of the
	 * corresponding interrupt.
	 *
	 * -------------------------------------------
	 * 			Handler 			Field Register
	 * -------------------------------------------
	 * Memory management fault 		PRI_4
	 * System handler Bus fault 	PRI_5
	 * Usage fault 					PRI_6
	 * SVCall 						PRI_11
	 * PendSV 						PRI_14
	 * SysTick 						PRI_15
	 * --------------------------------------------
	 *
	 * Each PRI_n field is 8 bits wide, but the processor implements
	 * only bits[7:4] of each field, and bits[3:0] read as zero
	 *
	 * SysTick is found on PRI_15 (MSByte of the SHPR3 register)
	 *
	 * In the library SCB->SHP[0] is related to PRI_4, SCB->SHP[1] to
	 * PRI_5, and so on. Therefore, to located a particular "n" we only
	 * need to subtract 4. Hence, for the Systick (PRI_15) n is 15, and
	 * is located on 15 - 4 = 11, i.e., on SCB->SHP[11].
	 */
	SCB->SHP[11] = (15 << 4); 	// Set the lower priority
	SysTick->CTRL |= 1 << 1;	// Enable Systick interrupt
	SysTick->CTRL |= 1 << 0;	// Enable Systick timer
}

/*
 **************************************************************
 * TIMER PERIPHERAL
 **************************************************************
 */
static void timer_config_gpio(TIM_TypeDef *TIMx, timer_channel_t ch, bool output)
{
    GPIO_TypeDef *port = NULL;
    uint8_t pin = 0;

    /* Determinar pin según timer y canal */
    if(TIMx == TIM1)
    {
        switch(ch)
        {
            case TIMER_CHANNEL_1: port = GPIOA; pin = 8;  break;
            case TIMER_CHANNEL_2: port = GPIOA; pin = 9;  break;
            case TIMER_CHANNEL_3: port = GPIOA; pin = 10; break;
            case TIMER_CHANNEL_4: port = GPIOA; pin = 11; break;
        }
    }
    else if(TIMx == TIM2)
    {
        switch(ch)
        {
            case TIMER_CHANNEL_1: port = GPIOA; pin = 0; break;
            case TIMER_CHANNEL_2: port = GPIOA; pin = 1; break;
            case TIMER_CHANNEL_3: port = GPIOA; pin = 2; break;
            case TIMER_CHANNEL_4: port = GPIOA; pin = 3; break;
        }
    }
    else if(TIMx == TIM3)
    {
        switch(ch)
        {
            case TIMER_CHANNEL_1: port = GPIOA; pin = 6; break;
            case TIMER_CHANNEL_2: port = GPIOA; pin = 7; break;
            case TIMER_CHANNEL_3: port = GPIOB; pin = 0; break;
            case TIMER_CHANNEL_4: port = GPIOB; pin = 1; break;
        }
    }
    else if(TIMx == TIM4)
    {
        switch(ch)
        {
            case TIMER_CHANNEL_1: port = GPIOB; pin = 6; break;
            case TIMER_CHANNEL_2: port = GPIOB; pin = 7; break;
            case TIMER_CHANNEL_3: port = GPIOB; pin = 8; break;
            case TIMER_CHANNEL_4: port = GPIOB; pin = 9; break;
        }
    }

    if(port == NULL) return;

    /* Configurar modo GPIO */
    if(output)
        gpio_set_output(port, pin, GPIO_OUTPUT_AF_PP, GPIO_SPEED_50MHZ);
    else
        gpio_set_input(port, pin, GPIO_INPUT_FLOAT);
}













/* Inicializa un timer general-purpose o advanced */
void timer_init(TIM_TypeDef *TIMx, timer_mode_t mode, uint32_t period, uint16_t prescaler)
{
    /* Habilitar reloj del timer (RCC) según TIMx */
	switch((uint32_t)TIMx)
	{
		case (uint32_t)TIM1: RCC->APB2ENR |= RCC_APB2ENR_TIM1EN; break;
		case (uint32_t)TIM2: RCC->APB1ENR |= RCC_APB1ENR_TIM2EN; break;
		case (uint32_t)TIM3: RCC->APB1ENR |= RCC_APB1ENR_TIM3EN; break;
		case (uint32_t)TIM4: RCC->APB1ENR |= RCC_APB1ENR_TIM4EN; break;
	}

  /* Detener timer antes de configurar */
  TIMx->CR1 = 0x00000000;
  TIMx->CR2 = 0x00000000;

	/* Reloj interno */
	TIMx->SMCR = 0x00000000;

  /* Configurar prescaler */
  TIMx->PSC = prescaler;

  /* Configurar periodo (ARR) */
  TIMx->ARR = period;

  /* Configurar modo */
	switch(mode)
	{
		case TIMER_MODE_UP:
			TIMx->CR1 &= ~TIM_CR1_DIR;    // Cuenta ascendente
		break;

		case TIMER_MODE_DOWN:
			TIMx->CR1 |= TIM_CR1_DIR; // Cuenta descendente
		break;

		case TIMER_MODE_CENTER:
			TIMx->CR1 |= TIM_CR1_CMS_0 | TIM_CR1_CMS_1; // Center-aligned
		break;
	}
}

void timer_set_clock_source(TIM_TypeDef *TIMx, timer_clk_src_t src)
{
    /* Reset SMCR */
    TIMx->SMCR = 0;

		/* Select clock source */
    switch (src)
    {
        case TIMER_CLK_INTERNAL:
            TIMx->SMCR = 0;
            break;

        case TIMER_CLK_EXTERNAL_TI1:
            TIMx->SMCR |= TIM_SMCR_SMS;                 // External clock mode 1
            TIMx->SMCR |= TIM_SMCR_TS_2 | TIM_SMCR_TS_0; // TI1FP1
            break;

        case TIMER_CLK_EXTERNAL_TI2:
            TIMx->SMCR |= TIM_SMCR_SMS;
            TIMx->SMCR |= TIM_SMCR_TS_2 | TIM_SMCR_TS_1; // TI2FP2
            break;

        case TIMER_CLK_EXTERNAL_ETR:
            TIMx->SMCR |= TIM_SMCR_ECE; // Enable ETR clock
            break;

        case TIMER_CLK_TRIGGER:
            TIMx->SMCR |= TIM_SMCR_SMS_2; // Trigger mode
            TIMx->SMCR |= TIM_SMCR_TS_0;  // ITR0 (puedes cambiar)
            break;

        case TIMER_CLK_ENCODER:
            TIMx->SMCR |= TIM_SMCR_SMS_0 | TIM_SMCR_SMS_1; // Encoder mode 3
            break;

        default:
            break;
    }
}

uint32_t timer_get_clock(TIM_TypeDef *TIMx)
{
    uint32_t ppre_bits;
    uint32_t timer_clk;

    // 1. Determinar frecuencia del bus del timer
    if ( TIMx == TIM1 )
    {
    	timer_clk = rcc_get_bus_clock(RCC_BUS_APB2);
        ppre_bits = (RCC->CFGR >> 11) & 0x7;
    }
    else
    {
    	timer_clk = rcc_get_bus_clock(RCC_BUS_APB1);
        ppre_bits = (RCC->CFGR >> 8) & 0x7;
    }

    // 2. Determinar multiplicador basado en si el prescaler es 1 o mayor
    // Según RM0008:
    // 0xx: división por 1
    // >=100: división por 2,4,8,16
    if (ppre_bits & 0x04) timer_clk <<= 1;  // Prescaler != 1, timer clock = bus clock * 2

    return timer_clk;
}

/* Inicia el timer, opcional one-shot */
void timer_start(TIM_TypeDef *TIMx, timer_run_mode_t run_mode)
{
    if (run_mode==TIMER_ONESHOT) TIMx->CR1 |= TIM_CR1_OPM; // One shot mode
    else TIMx->CR1 &= ~TIM_CR1_OPM;

    TIMx->CR1 |= TIM_CR1_CEN; // Activar timer
}

/* Detiene el timer */
void timer_stop(TIM_TypeDef *TIMx)
{
    TIMx->CR1 &= ~TIM_CR1_CEN; // Desactivar timer
}

/* Resetea el contador */
void timer_reset(TIM_TypeDef *TIMx)
{
    TIMx->CNT = 0;
}

