fhermosilloup/MCU26/Biblioteca/HAL/stm32f103_hal.c
/* Configura interrupciones del timer */
void timer_set_interrupt(TIM_TypeDef *TIMx, timer_irq_t irq, irq_state_t state)
{
    switch (irq)
    {
        case TIMER_IRQ_UPDATE:      // Update interrupt
			if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_UIE;
			else TIMx->DIER &= ~TIM_DIER_UIE;
		break;

        case TIMER_IRQ_CC1:          // Capture/Compare interrupt (ej. CC1)
			if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_CC1IE;
			else TIMx->DIER &= ~TIM_DIER_CC1IE;
		break;

		case TIMER_IRQ_CC2:          // Capture/Compare interrupt (ej. CC1)
			if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_CC2IE;
			else TIMx->DIER &= ~TIM_DIER_CC2IE;
		break;

		case TIMER_IRQ_CC3:          // Capture/Compare interrupt (ej. CC1)
			if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_CC3IE;
			else TIMx->DIER &= ~TIM_DIER_CC3IE;
		break;

		case TIMER_IRQ_CC4:          // Capture/Compare interrupt (ej. CC1)
			if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_CC4IE;
			else TIMx->DIER &= ~TIM_DIER_CC4IE;
		break;

        case TIMER_IRQ_TRIGGER:     // Trigger interrupt
					if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_TIE;
					else TIMx->DIER &= ~TIM_DIER_TIE;
        break;

        case TIMER_IRQ_BREAK:       // Break interrupt (solo TIM1/TIM8)
			if(TIMx==TIM1)
			{
				if (state == IRQ_ENABLE) TIMx->DIER |= TIM_DIER_BIE;
				else TIMx->DIER &= ~TIM_DIER_BIE;
			}
        break;

        default:
		break;
    }
}

void timer_set_trgo(TIM_TypeDef *TIMx, timer_trgo_t trgo)
{
	TIMx->CR2 &= ~(0x7 << 4);   			// limpiar MMS
    TIMx->CR2 |=  ((uint32_t)trgo << 4);  	// asignar
}


void timer_set_ic_channel(
        TIM_TypeDef *TIMx,
        timer_channel_t ch,
        timer_ic_src_t src,
        timer_ic_polarity_t polarity,
        timer_ic_div_t prescaler,
        timer_ic_filter_t filter)
{
	switch(ch)
	{
		case TIMER_CHANNEL_1:
			// Clear config
			TIMx->CCER &= ~(0x0F << 0);
			TIMx->CCMR1 &= ~(0xFF << 0);

			// Set IC config
			TIMx->CCMR1 |= ((uint32_t)src << 0);
			TIMx->CCMR1 |= (((uint32_t)prescaler & 0x3) << 2);
			TIMx->CCMR1 |= (((uint32_t)filter & 0xF) << 4);

			// Set detection edge
			if(polarity==TIMER_IC_FALLING) TIMx->CCER |= (1 << 1);

			// Enable channel
			TIMx->CCER |= (1 << 0);
		break;

		case TIMER_CHANNEL_2:
			// Clear config
			TIMx->CCER &= ~(0x0F << 4);
			TIMx->CCMR1 &= ~(0xFF << 8);

			// Set IC config
			TIMx->CCMR1 |= ((uint32_t)src << 8);
			TIMx->CCMR1 |= (((uint32_t)prescaler & 0x3) << 10);
			TIMx->CCMR1 |= (((uint32_t)filter & 0xF) << 12);

			// Set detection edge
			if(polarity==TIMER_IC_FALLING) TIMx->CCER |= (1 << 5);

			// Enable channel
			TIMx->CCER |= (1 << 4);
		break;

		case TIMER_CHANNEL_3:
			// Clear config
			TIMx->CCER &= ~(0x0F << 8);
			TIMx->CCMR2 &= ~(0xFF << 0);

			// Set IC config
			TIMx->CCMR2 |= ((uint32_t)src << 0);
			TIMx->CCMR2 |= (((uint32_t)prescaler & 0x3) << 2);
			TIMx->CCMR2 |= (((uint32_t)filter & 0xF) << 4);

			// Set detection edge
			if(polarity==TIMER_IC_FALLING) TIMx->CCER |= (1 << 9);

			// Enable channel
			TIMx->CCER |= (1 << 8);
		break;

		case TIMER_CHANNEL_4:
			// Clear config
			TIMx->CCER &= ~(0x0F << 12);
			TIMx->CCMR2 &= ~(0xFF << 8);

			// Set IC config
			TIMx->CCMR2 |= ((uint32_t)src << 8);
			TIMx->CCMR2 |= (((uint32_t)prescaler & 0x3) << 10);
			TIMx->CCMR2 |= (((uint32_t)filter & 0xF) << 12);

			// Set detection edge
			if(polarity==TIMER_IC_FALLING) TIMx->CCER |= (1 << 13);

			// Enable channel
			TIMx->CCER |= (1 << 12);
		break;

		default: return;
	}

	/* Configure gpio */
	timer_config_gpio(TIMx, ch, false);
}

void timer_set_ic_polarity(TIM_TypeDef *TIMx, timer_channel_t ch, timer_ic_polarity_t polarity)
{
	TIMx->CCER &= ~(1 << ((uint32_t)ch * 4 + 1));
	TIMx->CCER |= ((uint32_t)polarity << ((uint32_t)ch * 4 + 1));
}

uint32_t timer_get_capture_value(TIM_TypeDef *TIMx, timer_channel_t ch)
{
    switch(ch)
    {
        case TIMER_CHANNEL_1:
            return TIMx->CCR1;

        case TIMER_CHANNEL_2:
            return TIMx->CCR2;

        case TIMER_CHANNEL_3:
            return TIMx->CCR3;

        case TIMER_CHANNEL_4:
            return TIMx->CCR4;

        default:
            return 0;
    }
}

void timer_set_oc_channel(
        TIM_TypeDef *TIMx,
        timer_channel_t ch,
        timer_oc_mode_t mode,
        timer_oc_polarity_t polarity,
        uint32_t compare_value,
        bool output_enabled)
{
	uint32_t shift = ((uint32_t)ch % 2) << 3;
	volatile uint32_t *ccmr;

	/* Select CCMR register */
	if ((uint32_t)ch < 2) ccmr = &TIMx->CCMR1;
	else ccmr = &TIMx->CCMR2;

	/* Disable channel */
	TIMx->CCER &= ~(1 << ((uint32_t)ch * 4));

	/* Clear configuration */
	*ccmr &= ~(0xFF << shift);

	/* Configure Output Compare mode */
	*ccmr |= ((uint32_t)mode << (shift + 4));

	/* Enable preload (recommended for PWM) */
	*ccmr |= (1 << (shift + 3));

	/* Set compare value */
	TIMx->CR1 |= TIM_CR1_ARPE;
	switch(ch)
	{
		case TIMER_CHANNEL_1: TIMx->CCR1 = compare_value; break;
		case TIMER_CHANNEL_2: TIMx->CCR2 = compare_value; break;
		case TIMER_CHANNEL_3: TIMx->CCR3 = compare_value; break;
		case TIMER_CHANNEL_4: TIMx->CCR4 = compare_value; break;
	}

	/* Configure polarity */
	if (polarity == TIMER_OC_POLARITY_LOW)
			TIMx->CCER |= (1 << (ch * 4 + 1));
	else
			TIMx->CCER &= ~(1 << (ch * 4 + 1));

	/* Enable output if requested */
	if (output_enabled)
	{
		TIMx->CCER |= (1 << ((uint32_t)ch * 4));

		/* Configure gpio */
		timer_config_gpio(TIMx, ch, true);
	}
}

void timer_set_compare_value(TIM_TypeDef *TIMx, timer_channel_t ch, uint32_t value)
{
    switch(ch)
    {
        case TIMER_CHANNEL_1:
            TIMx->CCR1 = value;
            break;

        case TIMER_CHANNEL_2:
            TIMx->CCR2 = value;
            break;

        case TIMER_CHANNEL_3:
            TIMx->CCR3 = value;
            break;

        case TIMER_CHANNEL_4:
            TIMx->CCR4 = value;
            break;

        default:
            break;
    }
}


void timer_set_slave(TIM_TypeDef *tim,
                     timer_slave_mode_t mode,
                     timer_trgi_t trgi)
{
    // Limpiar campos SMS[2:0] y TS[2:0]
    tim->SMCR &= ~(TIM_SMCR_SMS_Msk | TIM_SMCR_TS_Msk);

    // Configurar modo esclavo y trigger
    tim->SMCR |= ((uint32_t)mode << TIM_SMCR_SMS_Pos) |
                 ((uint32_t)trgi << TIM_SMCR_TS_Pos);
}


void timer_set_encoder_mode(TIM_TypeDef *TIMx, timer_encoder_mode_t mode)
{
	/* Configurar GPIOs para CH1 y CH2 */
	timer_config_gpio(TIMx, TIMER_CHANNEL_1, false);
	timer_config_gpio(TIMx, TIMER_CHANNEL_2, false);

