fhermosilloup/MCU26/Biblioteca/HAL/stm32f103_hal.c
	/* Limpiar modo encoder */
	TIMx->SMCR &= ~TIM_SMCR_SMS;

	/* Establecer modo encoder */
	TIMx->SMCR |= (uint32_t)mode;

	/* Configurar CH1 y CH2 como entradas */
	TIMx->CCMR1 &= ~(TIM_CCMR1_CC1S | TIM_CCMR1_CC2S);
	TIMx->CCMR1 |= (1 << 0) | (1 << 8);

	/* Habilitar captura en ambos canales */
	TIMx->CCER |= TIM_CCER_CC1E | TIM_CCER_CC2E;

	/* Polaridad por defecto: rising */
	TIMx->CCER &= ~(TIM_CCER_CC1P | TIM_CCER_CC2P);

	/* Resetear contador */
	TIMx->CNT = 0;
}

int32_t timer_get_encoder_count(TIM_TypeDef *TIMx)
{
    return (int32_t)TIMx->CNT;
}

typedef struct {
    TIM_TypeDef *tim;
    DMA_Channel_TypeDef *channels[5]; // UPDATE, CC1..CC4
} timer_dma_channel_map_t;

const timer_dma_channel_map_t timer_dma_table[] = {
    {TIM1, {DMA1_Channel5, DMA1_Channel2, NULL, 		 DMA1_Channel6, DMA1_Channel4}},
    {TIM2, {DMA1_Channel2, DMA1_Channel5, DMA1_Channel7, DMA1_Channel1, DMA1_Channel7}},
    {TIM3, {DMA1_Channel3, DMA1_Channel6, NULL, 		 DMA1_Channel2, DMA1_Channel3}},
    {TIM4, {DMA1_Channel7, DMA1_Channel1, DMA1_Channel4, DMA1_Channel5, NULL}}
};

DMA_Channel_TypeDef* timer_get_dma_channel(TIM_TypeDef *tim, timer_dma_event_t event)
{
    for (int i=0; i < 4; i++)
    {
        if (timer_dma_table[i].tim == tim)
        {
            return timer_dma_table[i].channels[event];
        }
    }
    return NULL;
}

void timer_set_dma(TIM_TypeDef *tim,
				   dma_dir_t dir,
                   dma_mode_t mode,
                   timer_dma_event_t event,
                   timer_dma_periph_t periph_reg,
				   void *buffer,
                   uint16_t length)
{
	// Get DMA channel
    DMA_Channel_TypeDef *dma_ch = timer_get_dma_channel(tim, event);
	if(dma_ch==NULL) return;

	// Get Peripheral's register
	volatile uint32_t *preg=NULL;
	switch(periph_reg)
	{
		case TIMER_DMA_PERIPH_ARR: preg = &tim->ARR; break;

		case TIMER_DMA_PERIPH_CCR1: preg = &tim->CCR1; break;

		case TIMER_DMA_PERIPH_CCR2: preg = &tim->CCR2; break;

		case TIMER_DMA_PERIPH_CCR3: preg = &tim->CCR3; break;

		case TIMER_DMA_PERIPH_CCR4: preg = &tim->CCR4; break;
	}

	// Initializes DMA channel
    dma_init(dma_ch,
             dir,
             DMA_SIZE_16BIT,
             DMA_SIZE_16BIT,
             true,
             false,
             mode,
             DMA_PRIORITY_HIGH);

	// Set DMA addresses
    dma_set_addresses(dma_ch, preg, buffer, length);

	// Enable Timer DMA mode
    tim->DIER |= 1 << (8 + (uint32_t)event);

	// Enable DMA channel
    dma_start(dma_ch);
}


/*
 **************************************************************
 * ANALOG TO DIGITAL CONVERTER PERIPHERAL
 **************************************************************
 */
 void adc_init(ADC_TypeDef *ADCx, adc_mode_t mode, adc_trigger_t trig, adc_align_t align)
{
	/*  Habilitar reloj ADC  */
	if (ADCx == ADC1) RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;
	else if (ADCx == ADC2) RCC->APB2ENR |= RCC_APB2ENR_ADC2EN;

	/* ADC clock = PCLK2 / 6  (12 MHz máx) */
	//RCC->CFGR &= ~RCC_CFGR_ADCPRE;
	//RCC->CFGR |= RCC_CFGR_ADCPRE_DIV6;

	/*  Encender ADC  */
	ADCx->CR2 |= ADC_CR2_ADON;

	/*  Calibración  */
	ADCx->CR2 |= ADC_CR2_RSTCAL;
	while(ADCx->CR2 & ADC_CR2_RSTCAL);
	ADCx->CR2 |= ADC_CR2_CAL;
	while(ADCx->CR2 & ADC_CR2_CAL);

	/*  Apagar ADC  */
	ADCx->CR2 &= ~ADC_CR2_ADON;

	/*  Reset configuración  */
	ADCx->CR1 = 0;
	ADCx->CR2 = 0;

	/*  Modo  */
	ADCx->CR1 &= ~ADC_CR1_SCAN;
	ADCx->CR2 &= ~ADC_CR2_CONT;
	switch(mode)
	{
		case ADC_MODE_SINGLE:
			/* Nada que activar */
			break;

		case ADC_MODE_CONTINUOUS:
			ADCx->CR2 |= ADC_CR2_CONT;
		break;

		case ADC_MODE_SCAN_SINGLE:
			ADCx->CR1 |= ADC_CR1_SCAN;
		break;

		case ADC_MODE_SCAN_CONTINUOUS:
			ADCx->CR1 |= ADC_CR1_SCAN;
			ADCx->CR2 |= ADC_CR2_CONT;
		break;

		default:
		break;
	}

	/*  Alineación  */
	if (align == ADC_ALIGN_LEFT)
			ADCx->CR2 |= ADC_CR2_ALIGN;
	else
			ADCx->CR2 &= ~ADC_CR2_ALIGN;

	/*  Sampling time (todos los canales)  */
	ADCx->SMPR1 = 0;
	ADCx->SMPR2 = 0;

	/*  Trigger  */
	ADCx->CR2 |= 1 << 20; // Allows external trigger
	ADCx->CR2 &= ~(0x07<<17); // Clear EXTSEL
	ADCx->CR2 |= (uint32_t)trig << 17; // Set EXTSEL
}

void adc_set_channel(ADC_TypeDef *ADCx, adc_channel_t channel, adc_sample_t samp)
{
	// Longitud = 1 conversión
	ADCx->SQR1 &= ~(0xF << 20); // L = 0, es 1 conversión

	// Canal en primera posición
	ADCx->SQR3 = channel;

	// Sample time
	if ((uint32_t)channel <= 9)
	{
		// SMPR2: canales 0–9
		uint32_t shift = (uint32_t)channel * 3;

		ADCx->SMPR2 &= ~(0x7 << shift);      // limpiar
		ADCx->SMPR2 |=  (samp << shift);     // asignar
	}
	else
	{
		// SMPR1: canales 10–17
		uint32_t shift = ((uint32_t)channel - 10) * 3;

		ADCx->SMPR1 &= ~(0x7 << shift);      // limpiar
		ADCx->SMPR1 |=  (samp << shift);     // asignar
	}

	// Enable INT_TEMP_SENS if needed
	ADCx->CR2 &= ~(1 << 23);
	if(channel >= ADC_CHANNEL_TSENSE) ADCx->CR2 |= (1 << 23);
}

void adc_set_sequence(ADC_TypeDef *ADCx, const adc_channel_t *channels, const adc_sample_t *samples, uint8_t len)
{
	if(len == 0 || len > 16) return;

	// Limpiar registros de secuencia
	ADCx->SQR1 = 0;
	ADCx->SQR2 = 0;
	ADCx->SQR3 = 0;

	// Configurar longitud (L = len - 1)
	ADCx->SQR1 |= (len - 1) << 20;

	for(int i = 0; i < len; i++)
	{
		adc_channel_t ch = channels[i];

		// -----------------------------
		// 1. Configurar secuencia (SQRx)
		// -----------------------------
		if(i < 6) ADCx->SQR3 |= ch << (i * 5);
		else if(i < 12) ADCx->SQR2 |= ch << ((i - 6) * 5);
		else ADCx->SQR1 |= ch << ((i - 12) * 5);

		// -----------------------------
		// 2. Configurar sample time (SMPRx)
		// -----------------------------
		adc_sample_t samp = samples[i];
		if(ch <= 9)
		{
			uint32_t shift = ch * 3;

			ADCx->SMPR2 &= ~(0x7 << shift);   // limpiar
			ADCx->SMPR2 |=  (samp << shift);  // asignar
		}
		else
		{
			uint32_t shift = (ch - 10) * 3;

			ADCx->SMPR1 &= ~(0x7 << shift);   // limpiar
			ADCx->SMPR1 |=  (samp << shift);  // asignar
		}

		// Enable INT_TEMP_SENS if needed
		ADCx->CR2 &= ~(1 << 23);
		if((uint32_t)ch >= ADC_CHANNEL_TSENSE) ADCx->CR2 |= (1 << 23);
	}
}

uint16_t adc_read(ADC_TypeDef *ADCx)
{
    // Start conversion
    ADCx->CR2 |= ADC_CR2_SWSTART;

    // Esperar fin de conversion
    while(!(ADCx->SR & ADC_SR_EOC));

    return ADCx->DR;
}

void adc_read_sequence(ADC_TypeDef *ADCx, uint16_t *buffer)
{
    uint8_t len = ((ADCx->SQR1 >> 20) & 0xF) + 1;

    // Start
    ADCx->CR2 |= ADC_CR2_SWSTART;

