fhermosilloup/MCU26/Biblioteca/HAL/stm32f103_hal.c
    for(int i = 0; i < len; i++)
    {
        while(!(ADCx->SR & ADC_SR_EOC));
        buffer[i] = ADCx->DR;
    }
}

/*  Iniciar conversión  */
void adc_start(ADC_TypeDef *ADCx)
{
    ADCx->CR2 |= ADC_CR2_ADON;
}

/*  Detener ADC  */
void adc_stop(ADC_TypeDef *ADCx)
{
    ADCx->CR2 &= ~ADC_CR2_ADON;
}


/*  Configurar interrupciones  */
void adc_set_interrupt(ADC_TypeDef *ADCx, adc_irq_t irq, irq_state_t state)
{
    switch(irq)
    {
        case ADC_IRQ_EOC:   /* End of conversion */
            if (state == IRQ_ENABLE)
                ADCx->CR1 |= ADC_CR1_EOCIE;
            else
                ADCx->CR1 &= ~ADC_CR1_EOCIE;
        break;

        case ADC_IRQ_EOS:   /* End of sequence */
            if (state == IRQ_ENABLE)
                ADCx->CR1 |= ADC_CR1_EOSIE;
            else
                ADCx->CR1 &= ~ADC_CR1_EOSIE;
        break;

        case ADC_IRQ_AWD:   /* Analog watchdog */
            if (state == IRQ_ENABLE)
                ADCx->CR1 |= ADC_CR1_AWDIE;
            else
                ADCx->CR1 &= ~ADC_CR1_AWDIE;
        break;

        default:
        break;
    }
}


void adc_set_dma(ADC_TypeDef *adc, uint16_t *buffer, uint16_t length,
                 dma_mode_t mode, adc_dma_event_t dma_event)
{
    DMA_Channel_TypeDef *dma_ch = (adc == ADC1) ? DMA1_Channel1 : DMA1_Channel1; // ADC2 también DMA1_Channel1 en F103

    dma_init(dma_ch,
             DMA_DIR_PERIPH_TO_MEM,
             DMA_SIZE_16BIT,
             DMA_SIZE_16BIT,
             false,  // Periph no incrementa
             true,   // Memoria incrementa
             mode,
             DMA_PRIORITY_HIGH);

    dma_set_addresses(dma_ch, &adc->DR, buffer, length);
    dma_set_interrupt(dma_ch, DMA_IRQ_TC, true);
    dma_set_interrupt(dma_ch, DMA_IRQ_HT, true);

    adc->CR2 |= ADC_CR2_DMA; // Habilitar solicitud DMA

    dma_start(dma_ch);
}







/*
 **************************************************************
 * UNIVERSAL SYNCHRONOUS/ASYNCHRONOUS RECEIVER TRANSMITTER
 **************************************************************
 */
void uart_init(USART_TypeDef *USARTx,
               uint32_t baudrate,
               uart_mode_t mode,
               uart_parity_t parity,
               uart_stopbits_t stopbits)
{
	/* Habilitar clock y gpio */
	if (USARTx == USART1) {
		rcc_clock_enable(RCC_USART1);
		rcc_clock_enable(RCC_GPIOA);

		// PA9  -> TX (AF PP)
		// PA10 -> RX (Input floating)
		gpio_set_output(GPIOA, GPIO_PIN_9, GPIO_OUTPUT_AF_PP, GPIO_SPEED_50MHZ);
		gpio_set_input(GPIOA, GPIO_PIN_10, GPIO_INPUT_FLOAT);

	} else if (USARTx == USART2) {
		rcc_clock_enable(RCC_USART2);
		rcc_clock_enable(RCC_GPIOA);

		// PA2 -> TX
		// PA3 -> RX
		gpio_set_output(GPIOA, GPIO_PIN_2, GPIO_OUTPUT_AF_PP, GPIO_SPEED_50MHZ);
		gpio_set_input(GPIOA, GPIO_PIN_3, GPIO_INPUT_FLOAT);

	} else if (USARTx == USART3) {
		rcc_clock_enable(RCC_USART3);
		rcc_clock_enable(RCC_GPIOB);

		// PB10 -> TX
		// PB11 -> RX
		gpio_set_output(GPIOB, GPIO_PIN_10, GPIO_OUTPUT_AF_PP, GPIO_SPEED_50MHZ);
		gpio_set_input(GPIOB, GPIO_PIN_11, GPIO_INPUT_FLOAT);
	}
	else {
		return;
	}

    /* Deshabilitar USART */
    USARTx->CR1 &= ~USART_CR1_UE;

    /* Configurar baudrate */
    uint32_t pclk;
    if (USARTx == USART1) pclk = rcc_get_bus_clock(RCC_BUS_APB2);
    else pclk = rcc_get_bus_clock(RCC_BUS_APB1);
    USARTx->BRR = (pclk + (baudrate / 2)) / baudrate;

    /* Configurar modo */
    USARTx->CR1 &= ~(USART_CR1_TE | USART_CR1_RE);
    if (mode == UART_MODE_TX) USARTx->CR1 |= USART_CR1_TE;
    else if (mode == UART_MODE_RX) USARTx->CR1 |= USART_CR1_RE;
    else USARTx->CR1 |= (USART_CR1_TE | USART_CR1_RE);

    /* Paridad */
    USARTx->CR1 &= ~(USART_CR1_PCE | USART_CR1_PS);

    if (parity == UART_PARITY_EVEN)
        USARTx->CR1 |= USART_CR1_PCE;
    else if (parity == UART_PARITY_ODD)
        USARTx->CR1 |= (USART_CR1_PCE | USART_CR1_PS);

    /* Stop bits */
    USARTx->CR2 &= ~(USART_CR2_STOP);

    switch (stopbits)
    {
        case UART_STOP_1:   USARTx->CR2 |= (0x0 << 12); break;
        case UART_STOP_0_5: USARTx->CR2 |= (0x1 << 12); break;
        case UART_STOP_2:   USARTx->CR2 |= (0x2 << 12); break;
        case UART_STOP_1_5: USARTx->CR2 |= (0x3 << 12); break;
    }

    /* Habilitar USART */
    USARTx->CR1 |= USART_CR1_UE;
}


void uart_write_byte(USART_TypeDef *USARTx, uint8_t data)
{
    while (!(USARTx->SR & USART_SR_TXE));
    USARTx->DR = data;
}

uint8_t uart_read_byte(USART_TypeDef *USARTx)
{
    while (!(USARTx->SR & USART_SR_RXNE));
    return (uint8_t)(USARTx->DR);
}

void uart_write(USART_TypeDef *USARTx, const uint8_t *data, uint16_t len)
{
    for (uint16_t i = 0; i < len; i++)
    {
        uart_write_byte(USARTx, data[i]);
    }
}

void uart_read(USART_TypeDef *USARTx, uint8_t *data, uint16_t len)
{
    for (uint16_t i = 0; i < len; i++)
    {
        data[i] = uart_read_byte(USARTx);
    }
}

void uart_set_interrupt(USART_TypeDef *USARTx,
                        uart_irq_t irq,
                        irq_state_t state)
{
    uint32_t bit = 0;

    switch (irq)
    {
        case UART_IRQ_TX:  	bit = USART_CR1_TXEIE; break;
        case UART_IRQ_TC:   bit = USART_CR1_TCIE; break;
        case UART_IRQ_RX: 	bit = USART_CR1_RXNEIE; break;
        case UART_IRQ_IDLE: bit = USART_CR1_IDLEIE; break;
        case UART_IRQ_PE:   bit = USART_CR1_PEIE; break;
        case UART_IRQ_ERR:  bit = USART_CR3_EIE; break;
    }

    if (irq == UART_IRQ_ERR)
    {
        if (state == IRQ_ENABLE)
            USARTx->CR3 |= bit;
        else
            USARTx->CR3 &= ~bit;
    }
    else
    {
        if (state == IRQ_ENABLE)
            USARTx->CR1 |= bit;
        else
            USARTx->CR1 &= ~bit;
    }
}


DMA_Channel_TypeDef* uart_get_dma_channel(USART_TypeDef *USARTx,
                                                 uart_dma_event_t event)
{
    if (USARTx == USART1)
        return (event == UART_DMA_TX) ? DMA1_Channel4 : DMA1_Channel5;

    if (USARTx == USART2)
        return (event == UART_DMA_TX) ? DMA1_Channel7 : DMA1_Channel6;

    if (USARTx == USART3)
        return (event == UART_DMA_TX) ? DMA1_Channel2 : DMA1_Channel3;

    return 0;
}

void uart_set_dma(USART_TypeDef *USARTx,
                  uart_dma_event_t event,
                  void *buffer,
                  uint16_t length)
{
    DMA_Channel_TypeDef *ch = uart_get_dma_channel(USARTx, event);

    if (!ch) return;

    /* Configuración básica DMA */
    dma_init(
        ch,
        (event == UART_DMA_TX) ? DMA_DIR_MEM_TO_PERIPH : DMA_DIR_PERIPH_TO_MEM,
        DMA_SIZE_8BIT,
        DMA_SIZE_8BIT,
        true,
        false,
        DMA_MODE_CIRCULAR,
        DMA_PRIORITY_HIGH
    );

    dma_set_addresses(
        ch,
        (void*)&USARTx->DR,
        buffer,
        length
    );

    /* Habilitar DMA en USART */
    if (event == UART_DMA_TX)
        USARTx->CR3 |= USART_CR3_DMAT;
    else
        USARTx->CR3 |= USART_CR3_DMAR;

    dma_start(ch);
}
